In [336]:
import pandas as pd
import os, sys

new_dir = '/Users/juanbello/Desktop/Kaggle'

sys.path.append(os.path.join(new_dir))

# Load the datasets
ed_df = pd.read_csv('education.csv') # education
hh_df = pd.read_csv('household.csv') # houshold

# # Display the first few rows of each dataset
ed_df.head()
# print(household_data.head())

,psu,hh,idcode,q01,q02,q03,q04,q05,q06,q07,...,Q57,Q58,Q59,Q60,Q61,Q62,Q63,Q64,Q65,Q66
0,2,8,3,1,1,1,2.0,3.0,3.0,2.0,...,2.0,NaN,2.0,NaN,2.0,NaN,NaN,2.0,NaN,2.0
1,3,8,4,1,1,1,2.0,2.0,2.0,0.0,...,2.0,NaN,2.0,NaN,2.0,NaN,NaN,2.0,NaN,2.0
2,6,5,3,1,1,1,2.0,3.0,3.0,0.0,...,2.0,NaN,2.0,NaN,2.0,NaN,NaN,2.0,NaN,4.0
3,7,7,3,1,1,1,6.0,1.0,3.0,0.0,...,2.0,NaN,2.0,NaN,2.0,NaN,NaN,2.0,NaN,6.0
4,16,2,4,1,1,1,5.0,3.0,2.0,4.0,...,2.0,NaN,2.0,NaN,2.0,NaN,NaN,2.0,NaN,2.0

In [338]:
### Prepare Ed data
def prepare_df(df, suffix : str):
    uids = df['psu'].astype(str) + "_"  + df['hh'].astype(str) + "_" + df['idcode'].astype(str) 
    df =  df.drop(columns=['psu', 'hh', 'idcode'])
    df.columns = [suffix + '_' + col for col in df.columns]
    df.insert(0, 'uid', uids)
    return df
    
# uids = ed_df['psu'].astype(str) + "_"  + ed_df['hh'].astype(str) + "_" + ed_df['idcode'].astype(str) 
# ed_df.insert(0, 'uid', uids)
# ed_df =  ed_df.drop(columns=['psu', 'hh', 'idcode'])
# ed_df.head()

ed_df = prepare_df(ed_df, "Ed")
hh_df = prepare_df(hh_df, "Hh")

In [217]:
ed_df.head()

,uid,Ed_q01,Ed_q02,Ed_q03,Ed_q04,Ed_q05,Ed_q06,Ed_q07,Ed_Q08,Ed_Q09,...,Ed_Q57,Ed_Q58,Ed_Q59,Ed_Q60,Ed_Q61,Ed_Q62,Ed_Q63,Ed_Q64,Ed_Q65,Ed_Q66
0,2_8_3,1,1,1,2.0,3.0,3.0,2.0,1.0,1.0,...,2.0,NaN,2.0,NaN,2.0,NaN,NaN,2.0,NaN,2.0
1,3_8_4,1,1,1,2.0,2.0,2.0,0.0,1.0,1.0,...,2.0,NaN,2.0,NaN,2.0,NaN,NaN,2.0,NaN,2.0
2,6_5_3,1,1,1,2.0,3.0,3.0,0.0,1.0,1.0,...,2.0,NaN,2.0,NaN,2.0,NaN,NaN,2.0,NaN,4.0
3,7_7_3,1,1,1,6.0,1.0,3.0,0.0,1.0,1.0,...,2.0,NaN,2.0,NaN,2.0,NaN,NaN,2.0,NaN,6.0
4,16_2_4,1,1,1,5.0,3.0,2.0,4.0,1.0,1.0,...,2.0,NaN,2.0,NaN,2.0,NaN,NaN,2.0,NaN,2.0

In [219]:
hh_df.head()

,uid,Hh_hhid,Hh_q02,Hh_q03,Hh_q04,Hh_q05y,Hh_q05m,Hh_q06,Hh_q07,Hh_q08,...,Hh_q13,Hh_q14,Hh_q15,Hh_q16,Hh_q17,Hh_q18,Hh_q19,Hh_q20,Hh_q21,Hh_q22
0,1_2_1,102,1,1,19600711,52,1,1.0,1.0,2.0,...,3.0,2.0,80.0,NaN,2,NaN,3.0,2.0,80.0,NaN
1,1_2_2,102,2,2,19650225,47,6,1.0,1.0,1.0,...,3.0,2.0,67.0,NaN,2,NaN,3.0,2.0,74.0,NaN
2,1_3_1,103,1,1,19540203,58,7,1.0,1.0,2.0,...,2.0,2.0,85.0,NaN,2,NaN,2.0,2.0,67.0,NaN
3,1_3_2,103,2,2,19560602,56,3,1.0,1.0,1.0,...,2.0,2.0,67.0,NaN,2,NaN,2.0,2.0,67.0,NaN
4,1_3_3,103,1,4,19850825,27,0,5.0,NaN,NaN,...,NaN,NaN,NaN,NaN,1,1.0,NaN,NaN,NaN,NaN

In [221]:
## join both
df = pd.merge(ed_df, hh_df, on="uid", how="inner")
df.head()

,uid,Ed_q01,Ed_q02,Ed_q03,Ed_q04,Ed_q05,Ed_q06,Ed_q07,Ed_Q08,Ed_Q09,...,Hh_q13,Hh_q14,Hh_q15,Hh_q16,Hh_q17,Hh_q18,Hh_q19,Hh_q20,Hh_q21,Hh_q22
0,2_8_3,1,1,1,2.0,3.0,3.0,2.0,1.0,1.0,...,NaN,NaN,NaN,NaN,1,1.0,NaN,NaN,NaN,NaN
1,3_8_4,1,1,1,2.0,2.0,2.0,0.0,1.0,1.0,...,NaN,NaN,NaN,NaN,1,1.0,NaN,NaN,NaN,NaN
2,6_5_3,1,1,1,2.0,3.0,3.0,0.0,1.0,1.0,...,NaN,NaN,NaN,NaN,1,1.0,NaN,NaN,NaN,NaN
3,7_7_3,1,1,1,6.0,1.0,3.0,0.0,1.0,1.0,...,NaN,NaN,NaN,NaN,1,1.0,NaN,NaN,NaN,NaN
4,16_2_4,1,1,1,5.0,3.0,2.0,4.0,1.0,1.0,...,NaN,NaN,NaN,NaN,1,1.0,NaN,NaN,NaN,NaN

# Note:
* The above pd is the pure aggregated one. Try NaN processings on copies of it. It is the baseline df.

# Replacing NaN's

In [313]:
# nan_counts = hh_df.isna().sum()
# came in clutch for sanity check

In [319]:
columns_with_nan = df.columns[df.isna().any()]
columns_with_nan
## need to find out what to replace NaN values in each of the following:
## replacement will be 0, average, etc based on column meaning
# list(columns_with_nan)

Index(['Ed_q04', 'Ed_q05', 'Ed_q06', 'Ed_q07', 'Ed_Q08', 'Ed_Q09', 'Ed_Q10',
       'Ed_Q11', 'Ed_Q12', 'Ed_Q13', 'Ed_Q14', 'Ed_Q15', 'Ed_Q16', 'Ed_Q17',
       'Ed_Q18', 'Ed_Q19', 'Ed_Q20', 'Ed_Q21', 'Ed_Q22', 'Ed_Q23', 'Ed_Q24',
       'Ed_Q25', 'Ed_Q26', 'Ed_Q27', 'Ed_Q28', 'Ed_Q29', 'Ed_Q30', 'Ed_Q31',
       'Ed_Q32', 'Ed_Q33', 'Ed_Q34', 'Ed_Q35', 'Ed_Q36', 'Ed_Q37', 'Ed_Q38',
       'Ed_Q39', 'Ed_Q40', 'Ed_Q41', 'Ed_Q42', 'Ed_Q43', 'Ed_Q44', 'Ed_Q45',
       'Ed_Q46', 'Ed_Q47', 'Ed_Q48', 'Ed_Q49', 'Ed_Q50', 'Ed_Q51', 'Ed_Q52',
       'Ed_Q53', 'Ed_Q54', 'Ed_Q55', 'Ed_Q56', 'Ed_Q57', 'Ed_Q58', 'Ed_Q59',
       'Ed_Q60', 'Ed_Q61', 'Ed_Q62', 'Ed_Q63', 'Ed_Q64', 'Ed_Q65', 'Ed_Q66',
       'Hh_q06', 'Hh_q07', 'Hh_q08', 'Hh_q12', 'Hh_q13', 'Hh_q14', 'Hh_q15',
       'Hh_q16', 'Hh_q18', 'Hh_q19', 'Hh_q20', 'Hh_q21', 'Hh_q22'],
      dtype='object')

### Which columns can be replaced by a zero?

* Categorical answered-questions for which zero is not one of the categories. By replacing them with a zero, we are implicitly adding an additional category for "No response"
  
* We need to make sure zero is not a feasible value in the column. otherwise it already means something and we need a new indicator. We also need to make sure it is categorical, if a column is numeric and we add a value of zero, then that doesnt make sense, add the average instead.

In [325]:
min_vals = df[columns_with_nan].min()
zero_valued_columns = []
non_zero_valued_columns = []

for index, value in min_vals.items():
    if float(value) < 1:
        zero_valued_columns.append(index)
        # print(f"Index: {index}, Value: {value}")
    else:
        non_zero_valued_columns.append(index)

In [327]:
# These ones we can't replace with zero. 
zero_valued_columns

['Ed_q04',
 'Ed_q05',
 'Ed_q06',
 'Ed_q07',
 'Ed_Q24',
 'Ed_Q26',
 'Ed_Q27',
 'Ed_Q29',
 'Ed_Q31',
 'Ed_Q33',
 'Ed_Q34',
 'Ed_Q35',
 'Ed_Q36',
 'Ed_Q37',
 'Ed_Q38',
 'Ed_Q39',
 'Ed_Q40',
 'Ed_Q41',
 'Ed_Q47',
 'Ed_Q49',
 'Ed_Q60',
 'Ed_Q62',
 'Ed_Q65']

# Mergining Ed Q8, Q9, Q10, Q11 into one
about attending school
* Q8 Did you enroll this year?									
* Q9 will you attend this year?									
* Q10 Why not attending this year?							
* Q11 Why not enrolling this year?

Funny situations:
enrolled but will not attend. We can only care about attending. 

Our aggregation variable could be a merge of "why not attending/enrolling or attending"

After merging all 4 columns into one, we may need to further break down, transform the categories... maybe get rid of anything that is not about money (illness, poor quality of teaching, )

In [438]:
######### Q10 and Q11
## the values match except for 13. An answer of 13 in Q10 should be transformed into a 14 before merging 
df.loc[df['Ed_Q10'] == 13, 'Ed_Q10'] = 14

# RANGES
print(df['Ed_Q10'].describe()) # range 1-13
print('\n')
print(df['Ed_Q11'].describe())  # range 1-14

# filtered = df[df['Ed_Q10'] == 13]
# filtered['Ed_Q10']

Series([], Name: Ed_Q10, dtype: float64)

In [450]:
## any point when Ed_Q10 and Ed_Q11 are the not the same and are not NaN? NO
different_values = df['Ed_Q10'].ne(df['Ed_Q11']) & df['Ed_Q11'].notna() & df['Ed_Q10'].notna()
result_df = df.loc[different_values, ['uid','Ed_Q10', 'Ed_Q11']]
assert(len(result_df) == 0 )

# The fact that result_df has no entries means we can just merge them!!!!
df['Merged_Q10_Q11'] = df['Ed_Q10'].fillna(df['Ed_Q11'])
df[['Merged_Q10_Q11']]

       Merged_Q10_Q11
0                 NaN
1                 NaN
2                 NaN
3                 NaN
4                 NaN
...               ...
22401            12.0
22402            13.0
22403             NaN
22404            14.0
22405            14.0

[22406 rows x 1 columns]

In [454]:
########## Q8 and Q9
different_values = df['Ed_Q08'].ne(df['Ed_Q09']) & df['Ed_Q08'].notna() & df['Ed_Q09'].notna()
# Filter the DataFrame to get 'Ed_Q08' and 'Ed_Q09' only if they are different
result_df = df.loc[different_values, ['uid','Ed_Q08', 'Ed_Q09']]
result_df.head(3)
## This is the funny sitautation when somene enorlled but will not attend. We only care about the fact that they will not attend

### can somne attend who did not enroll?
different_values = df['Ed_Q08' == 2] and df['Ed_Q08'].ne(df['Ed_Q09']) & df['Ed_Q08'].notna() & df['Ed_Q09'].notna()

KeyError: False

In [ ]:
df[['uid','Ed_Q08', 'Ed_Q09', 'Ed_Q10', "Ed_Q11"]].head()   ## double NaN means they will attend